{
  "auto_mapping": null,
  "base_model_name_or_path": "mistralai/Mistral-7B-Instruct-v0.3",
  "encoder_hidden_size": 4096,
  "inference_mode": true,
  "modules_to_save": null,
  "num_attention_heads": 8,
  "num_layers": 32,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 20,
  "peft_type": "PREFIX_TUNING",
  "peft_version": "0.17.2.dev0@f8aca0a0c237adda3d522675ac0c8f0c91c39bb3",
  "prefix_projection": false,
  "revision": null,
  "task_type": "CAUSAL_LM",
  "token_dim": 1024
}